# Make sure you have following env variables
# when using this Brewfile
#
#  HOMEBREW_CASK_OPTS="--appdir=/Applications"
#  RBENV_ROOT=/usr/local/var/rbenv
#  NVM_DIR=/usr/local/var/nvm

# Essential terminal utilities
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
# tap "homebrew/dupes" TODO: dupes.
tap "homebrew/services"
tap "jonof/kenutils"

brew "advancecomp"
brew "ansible"
# brew "apple-gcc42" TODO: not go for 10.14
brew "autoconf"
brew "curl", args: ["with-openssl"]
brew "emojify"
brew "geckodriver"
brew "gifsicle"
brew "git"
brew "gnupg"
brew "graphviz"
brew "heroku"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jhead"
brew "jonof/kenutils/pngout"
brew "jpeg"
brew "jpegoptim"
brew "less"
brew "libevent"
brew "libtool"
brew "libyaml"
brew "mackup"
brew "mysql", restart_service: true
brew "optipng"
brew "overmind"
brew "perl"
brew "pngcrush"
brew "pngquant"
brew "postgresql"
brew "qt"
brew "redis", restart_service: true
brew "ssh-copy-id"
brew "terminal-notifier"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "watchman"
brew "yarn"
brew "z"
brew "zsh"
brew "zsh-completions"

# Essential Mac applications
cask "alfred"
# cask "amazon-drive" # TODO: something wrong
cask "calibre"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-source-code-pro-for-powerline"
cask "clyang-welly"
cask "docker"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "gitup"
cask "google-chrome"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "keybase"
cask "ngrok"
cask "psequel"
# cask "rdm" # TODO: no longer available
cask "resilio-sync"
cask "sequel-pro"
cask "sigil"
cask "slack"
cask "spotify"
cask "subler"
cask "transmission"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox" # something wrong with promission
cask "visual-studio-code"
cask "xquartz"
cask "zeplin"

# Node version manager
brew 'nvm'

# Ruby
brew "rbenv"
brew 'ruby-build'
brew 'rbenv-default-gems'
