# Make sure you have following env variables
# when using this Brewfile
#
#  HOMEBREW_CASK_OPTS="--appdir=/Applications"
#  RBENV_ROOT=/usr/local/var/rbenv
#  NVM_DIR=/usr/local/var/nvm

# Essential terminal utilities
tap 'homebrew/services'
tap 'homebrew/dupes'
# brew 'apple-gcc42'
brew 'git'
brew 'hub'
brew 'postgresql'
brew 'mysql'
brew 'redis'
brew 'imagemagick'
brew 'readline'
brew 'qt'
brew 'watch'
brew 'z'
brew 'zsh'
brew 'zsh-completions'
brew 'ssh-copy-id'
brew 'heroku-toolbelt'
brew 'tmux'
brew 'vim'
brew 'httpie'
brew 'curl', args: ['with-openssl']
brew 'advancecomp'
brew 'gifsicle'
brew 'jhead'
brew 'jpegoptim'
brew 'jpeg'
brew 'optipng'
brew 'pngcrush'
brew 'pngquant'
brew 'jonof/kenutils/pngout'
brew 'mackup'

# Essential Mac applications
tap 'caskroom/cask'
tap 'caskroom/versions'

cask 'iterm2'
cask 'keka'
cask 'google-chrome'
cask 'firefox'
cask 'blisk'
cask 'dropbox'
cask 'atom'
cask 'xquartz'
cask 'amazon-drive'
cask 'gitup'
cask 'spotify'
cask 'karabiner-elements'
cask 'zeplin'
cask 'subler'
cask 'pgadmin4'
cask 'psequel'
cask 'transmission'
cask 'sequel-pro'
cask 'atext'

# Node version manager
brew 'nvm'

# Ruby
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
